#+MACRO: code     #+LaTeX: \def\mytitle{$1}

# f7 preview changes
# (local-set-key (kbd "<f7>") (lambda () (interactive) (suspend-frame) (disable-theme 'spacemacs-light) (org-reveal-export-to-html-and-browse) (load-theme 'spacemacs-light)))
# (local-set-key (kbd "<f7>") (lambda () (interactive) (disable-theme 'spacemacs-light) (org-reveal-export-to-html-and-browse) (load-theme 'spacemacs-light)))

#+TITLE: Do-it-yourself Module Systems
#+DESCRIPTION: Unbundling on the fly and mechanically obtaining termtypes from theories

#+AUTHOR: [[https://alhassy.github.io/][Musa Al-hassy]]
#+EMAIL: alhassy@gmail.com
#+OPTIONS: html-postamble:nil
#+PROPERTY: header-args:agda2 :tangle aim-2020.agda

# +TITLE: @@html:<div style="color:green; font-size: 70px">@@Unbundling   on   the   fly   and   mechanically   obtaining   termtypes   from   theories@@html:</div>@@
#+begin_src emacs-lisp :exports none
(make-local-variable 'org-reveal-title-slide)
(setq org-reveal-title-slide "<h2>%t</h2>
<h5 style=\"color: green\">Unbundling on the fly and mechanically obtaining termtypes from theories</h5>
<br><br>
<h4 style=\"color: rose\"><emph>Agda Implementors Meeting 2020</emph></h4>
<br>
<h>%a</h3>
<br>
<font size=\"1\">
<a href=\"?print-pdf&showNotes=true\">
⟪ Flattened View ; Press <code>?</code> for Help ⟫
</a>
</font>")
#+end_src

#+RESULTS:
#+begin_example
<h2>%t</h2>
<h5 style="color: green">Unbundling on the fly and mechanically obtaining termtypes from theories</h5>
<br><br>
<h4 style="color: rose"><emph>Agda Implementors Meeting 2020</emph></h4>
<br>
<h>%a</h3>
<br>
<font size="1">
<a href="?print-pdf&showNotes=true">
⟪ Flattened View ; Press <code>?</code> for Help ⟫
</a>
</font>
#+end_example

#+OPTIONS: timestamp:nil
#+OPTIONS: toc:nil d:nil

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:t reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
# OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: reveal_height:800

#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5

# Available transitions are: default|cube|page|concave|zoom|linear|fade|none.
#+REVEAL_TRANS: fade
# Available transitions are: default(black)|white|league|sky|beige|simple|serif|blood|night|moon|solarized
#+REVEAL_THEME: sky
# REVEAL_THEME: blood

#+REVEAL_HLEVEL: 2
# REVEAL_HEAD_PREAMBLE: <meta name="description" content="Org-Reveal Introduction.">
#+REVEAL_POSTAMBLE:
#+REVEAL_PLUGINS: (markdown notes)
#+REVEAL_EXTRA_CSS: ./local.css
#
# See here for examples of how fragments look
# https://revealjs.com/#/fragments
#
# Here for what themes look like
# https://revealjs.com/#/themes

#+MACRO: myfrag  #+ATTR_REVEAL: :frag (appear)

#+MACRO: begin-columns  #+REVEAL_HTML: <div style="width:50%;float:left">
#+MACRO: break-columns  #+REVEAL_HTML: </div> <div style="width:50%;float: left">
#+MACRO: end-columns #+REVEAL_HTML: </div>

# Place item in a 1×1 table then center the table.
# This works nicely for preformatted code whose indentation is important.
#
#+MACRO: begin-center #+REVEAL_HTML: <center><table width="50%" border="0""><tr><td>
#+MACRO: end-center  #+REVEAL_HTML: </td><tr></table></center>



:Info:

Title: Do-it-yourself Module Systems: Unbundling on the fly and mechanically
obtaining termtypes from theories

Terse Abstract: We show how a bit of reflection can be used to achieve on the
fly unbundling to lift record fields to the type level as parameters, and we use
monadic do-notation to make the resulting setup practical and pragmatic for
experimentation. It is well known in the folklore that record types are contexts
(i.e., sequences of name-type pairs), we go on to show that termtypes (GADTs)
are also contexts. Moreover, since records and termtypes are both contexts, we
show how to derive the latter from the former *mechanically* via a macro; e.g., we
mechanically ask for the termtype of dynamic systems, monoids, pointed sets,
collections and find the results to be that of the natural numbers, tree
skeletons, the maybe type, and the list type.  Surprisingly, the entire
development is under 300 lines of Agda.

Project webpage: https://alhassy.github.io/next-700-module-systems/

:end:

:Remarks:
+ live demo instead of video, quality was poor. ლ(ಠ益ಠ)

+ Give concrete examples.

+ Skip slides like toc and slides you ignore.
  - or, during the toc slide, set the stage
    for what's coming up.

    Give a background on the problem, quickly.

+ Don't stand in front of the slides. ─use the laser pointer‼

+ Use the NOTES to make speaker notes.

+ Say what is the approach I'm using to ensure that the problem is feasible.
  - Communicate that its doable and that I can do it.

+ Dicuss how even going to attempt doing this, the research

1. catchy subtitle: reptition means we're doing something wrong.

   A language has many languages, whence repetitive.

   Maybe show a proof or something that
   shows a DTL making use of the first
   five pieces together. ;-)
   Show the problem.

+ make it clear what I'm doing in 2 sentences:
  Providing primitives that minimise repetition
  for manipulaiting grouping mechanisms,
  without the end-user utilising preprocessing.

:End:
:How_to_enable_PDF_print_capabiility:

1. Open your presentation with print-pdf included in the query string i.e. http://localhost:8000/?print-pdf. You can test this with revealjs.com?print-pdf.
   - If you want to include speaker notes in your export, you can append showNotes=true to the query string: http://localhost:8000/?print-pdf&showNotes=true
2. Open the in-browser print dialog (CTRL/CMD+P).
3. Change the Destination setting to Save as PDF.
4. Change the Layout to Landscape.
5. Change the Margins to None.
6. Enable the Background graphics option.
7. Click Save.

:End:
:FragmentStyles:
The ATTR_REVEAL part must be immediately preceding the first item in a list, no new line;
other items may be freely spaced.

Available fragment styles are:
#+ATTR_REVEAL: :frag t
    * grow
    * shrink
    * roll-in
    * fade-out
    * highlight-red
    * highlight-green
    * highlight-blue
    * appear

    Fragment sequence can be changed by assigning adding ~:frag_idx~
    property to each fragmented element.

#+ATTR_REVEAL: :frag t :frag_idx 3
    And, this paragraph shows at last.

#+ATTR_REVEAL: :frag t :frag_idx 2
    This paragraph shows secondly.

#+ATTR_REVEAL: :frag t :frag_idx 1
    This paragraph shows at first.

~#+ATTR_REVEAL: :frag frag-style~ above a list defines fragment style for the list as a whole.
To define fragment styles for every list item, please enumerate each item's style in a lisp list.

When there is :frag_idx specified, insufficient fragment style list will be extended by its last element. So a :frag (appear) assigns each item of a list the appear fragment style.

#+BEGIN_SRC emacs-lisp
#+ATTR_REVEAL: :frag (appear)
   * I appear.
   * I appear.
   * I appear.
#+END_SRC

Nb: Org-reveal supports /editable code blocks/ using klipsify.

  # :frag_idx (5 4 3 2 1)
#+ATTR_REVEAL: :frag (grow shrink roll-in fade-out none)
+ I will grow.
+ I will shrink.
+ I rolled in.
+ I will fade out.
+ I don't fragment.

  EXPORT CURRENT SUBTREE
Use menu entry " C-c C-e R S" to export only current subtree, without the title slide and the table of content, for a quick preview of your current edition.
:End:

# Imports
#+begin_src agda2 :exports none
open import Relation.Binary.PropositionalEquality
open import Data.Nat
open import Data.Nat.Properties
#+end_src

:IGNORE:
#+begin_export html
<div style="position: absolute; bottom: 0px; color: green; text-align: center;">
Unbundling on the fly and mechanically obtaining termtypes from theories
</div>
#+end_export
:END:

